DataProcessors/ден_ФормированиеПланируемыхПоступленийДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ден_ФормированиеПланируемыхПоступленийДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключаяПодчиненные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/дог_ВидыОплатыПоДоговору.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>дог_ВидыОплатыПоДоговору</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Разовая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регулярная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоГрафику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСуммеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоИндивидуальномуГрафику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолнаяОплата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияОбъектов</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ден_ПланируемоеПоступлениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ден_ПланируемоеПоступлениеДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.ВозвратТоваровПоставщику</xr:Item>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
				<xr:Item>Document.СчетНаОплатуПокупателю</xr:Item>
				<xr:Item>Document.ПлатежноеПоручениеИсходящее</xr:Item>
				<xr:Item>Document.РеализацияУслугПоПереработке</xr:Item>
				<xr:Item>Document.АктОбОказанииПроизводственныхУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.фин_ФактическиеОборотыБюджетов</xr:Item>
				<xr:Item>AccumulationRegister.фин_ОборотыБюджетов</xr:Item>
				<xr:Item>AccumulationRegister.ден_ПредполагаемыеПоступленияПоБюджетам</xr:Item>
				<xr:Item>AccumulationRegister.ден_ПланируемыеПоступленияДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.фин_КонтролируемыеФинансовыеПоказатели</xr:Item>
				<xr:Item>AccumulationRegister.Удалить_фин_ОстаткиБюджетов</xr:Item>
				<xr:Item>AccountingRegister.фин_Бюджетирование</xr:Item>
				<xr:Item>AccumulationRegister.фин_ПрогнозИсполненияБюджетов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ден_ВидыОперацийПланируемоеПоступлениеДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьВПлатежныйКалендарь</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументСобытия</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетнаяДатаПрихода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФинансовыйПоказатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ФинансовыеПоказатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ден_ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.дог_ЭтапыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
								<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
								<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
								<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
								<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсВзаиморасчетов</Name>
							<Comment>Курс валюты взаиморасчетов по договору или валюты взаиморасчетов с подотчетником</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыРаспределенияПоПроектам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>фин_ЗначенияДополнительныхРеквизитовБюджетирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизита</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитБюджетирования</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.фин_ВидыСубконтоБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БюджетныеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Измерение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ФактическиеПоказателиБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.фин_ВидыСубконтоБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ден_ФормированиеПланируемыхПоступленийДенежныхСредств/Forms/Форма/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "УстановитьЗначенияРеквизитовППДС" Тогда
		
		Если ТипЗнч(Параметр) = Тип("Структура") Тогда
			
			Массив = Новый Массив();
			Если Параметр.ФинПоказательИспользовать Тогда
				Массив.Добавить("ФинансовыйПоказатель");
			КонецЕсли;
						
			Если Параметр.ПодразделениеИспользовать Тогда
				Массив.Добавить("Подразделение");
			КонецЕсли;	
			Если Параметр.СтатьяДДСИспользовать Тогда
				Массив.Добавить("СтатьяДДС");
            КонецЕсли;
			ЗаполнитьРеквизитыДерева(ДеревоЗаявок.ПолучитьЭлементы(), Массив, Параметр);
		
		КонецЕсли;
		
	КонецЕсли;	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура СтруктурноеПодразделениеОрганизацияПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(СтруктурноеПодразделениеОрганизация) Тогда 
		Объект.Организация = Неопределено;
		Объект.СтруктурноеПодразделение = Неопределено;
	Иначе 
		Результат = общ_РаботаСоСтруктурнымиПодразделениями.ПроверитьИзменениеЗначенийОрганизацииСтруктурногоПодразделения(СтруктурноеПодразделениеОрганизация, Объект.Организация, Объект.СтруктурноеПодразделение);
		Если Результат.ИзмененаОрганизация ИЛИ Результат.ИзмененоСтруктурноеПодразделение Тогда
			СтруктурноеПодразделениеОрганизацияПриИзмененииНаКлиенте(Истина, Результат);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктурноеПодразделениеОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	общ_РаботаСоСтруктурнымиПодразделениями.СтруктурноеПодразделениеНачалоВыбора(ЭтаФорма, СтандартнаяОбработка, Объект.Организация, Объект.СтруктурноеПодразделение, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВключаяПодчиненныеПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ <ДеревоЗаявок>

&НаКлиенте
Процедура ДеревоЗаявокПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если Элемент.ТекущиеДанные.ПолучитьЭлементы().Количество()>0 Тогда
		УстановитьФлажкиВПодчиненных(Элемент.ТекущиеДанные.ПолучитьЭлементы(),Элемент.ТекущиеДанные.Применить);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗаявокППДСОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗаявокППДСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Период.ДатаОкончания = '00010101' ИЛИ Период.ДатаНачала = '00010101' Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнен период формирования заявок!'"), , "Период");
		Возврат;
	ИначеЕсли Период.ДатаОкончания < Период.ДатаНачала Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Дата окончания периода не может быть больше даты начала периода!'"), , "Период");
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Организация не выбрана!'"), , "Организация");
		Возврат;
	КонецЕсли;
	ЗаполнитьНаСервере();
	УстановитьФлажкиВПодчиненных(ДеревоЗаявок.ПолучитьЭлементы(), Истина);
    РазвернутьДерево("ДеревоЗаявок", ДеревоЗаявок.ПолучитьЭлементы());
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	УстановитьФлажкиВПодчиненных(ДеревоЗаявок.ПолучитьЭлементы(), Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	УстановитьФлажкиВПодчиненных(ДеревоЗаявок.ПолучитьЭлементы(), Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаявки(Команда)
	
	СформироватьЗаявкиСерв();
	РазвернутьДерево("ДеревоЗаявок", ДеревоЗаявок.ПолучитьЭлементы());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизиты(Команда)
	
	ОткрытьФорму("Обработка.ден_ФормированиеПланируемыхПоступленийДенежныхСредств.Форма.ФормаЗаполненияРеквизитов", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Провести(Команда)
	
	ПровестиНаСервере();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура СтруктурноеПодразделениеОрганизацияПриИзмененииНаКлиенте(ОчищатьНекорректныеЗначения, Параметры)

	Параметры.Вставить("ОчищатьНекорректныеЗначения", ОчищатьНекорректныеЗначения);
	
	СтруктураРезультатаВыполнения = Неопределено;
	СтруктурноеПодразделениеОрганизацияПриИзмененииНаСервере(Параметры, СтруктураРезультатаВыполнения);
		
	Если Параметры.Свойство("ИзмененаОрганизация") И Параметры.ИзмененаОрганизация Тогда
		//
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСтруктурногоПодразделения(Результат, Параметры) Экспорт
	
	общ_РаботаСоСтруктурнымиПодразделениями.ПослеВыбораСтруктурногоПодразделения(Результат, Объект.Организация, Объект.СтруктурноеПодразделение, СтруктурноеПодразделениеОрганизация);
	Если Результат.ИзмененаОрганизация ИЛИ Результат.ИзмененоСтруктурноеПодразделение Тогда
		Модифицированность = Истина;
		Результат.Вставить("НеобходимоИзменитьЗначенияРеквизитовОбъекта", Ложь);
		СтруктурноеПодразделениеОрганизацияПриИзмененииНаКлиенте(Истина, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СтруктурноеПодразделениеОрганизацияПриИзмененииНаСервере(СтруктураПараметров = Неопределено, СтруктураРезультатаВыполнения)
	
	Если СтруктураПараметров = Неопределено	ИЛИ (СтруктураПараметров.Свойство("НеобходимоИзменитьЗначенияРеквизитовОбъекта") 
				И СтруктураПараметров.НеобходимоИзменитьЗначенияРеквизитовОбъекта) Тогда 
		общ_РаботаСоСтруктурнымиПодразделениями.СтруктурноеПодразделениеПриИзменении(СтруктурноеПодразделениеОрганизация, Объект.Организация, Объект.СтруктурноеПодразделение, СтруктураПараметров);
	КонецЕсли;
		
	ПриИзмененииЗначенияОрганизацииСервер(СтруктураПараметров, СтруктураРезультатаВыполнения);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииЗначенияОрганизацииСервер(СтруктураПараметров, СтруктураРезультатаВыполнения)
	
	Если НЕ СтруктураПараметров.ИзмененаОрганизация И НЕ СтруктураПараметров.ИзмененоСтруктурноеПодразделение Тогда
		Возврат;
	КонецЕсли;
	
	общ_РаботаСоСтруктурнымиПодразделениями.ПриИзмененииЗначенияОрганизации(Объект, , СтруктураРезультатаВыполнения);
	
	УправлениеФормой(ЭтаФорма);
			
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	Период.ДатаНачала = НачалоМесяца(ТекущаяДата());
	Период.ДатаОкончания = КонецМесяца(ТекущаяДата());
	МинимальнаяДатаПлатежа = ТекущаяДата();
	
	Если Параметры.Свойство("Договор") Тогда
		Объект.Договор = Параметры.Договор;
	КонецЕсли;
	Если Параметры.Свойство("Контрагент") Тогда
		Объект.Контрагент = Параметры.Контрагент;
	КонецЕсли;
	Если Параметры.Свойство("Организация") Тогда
		Объект.Организация = Параметры.Организация;
	Иначе
		Объект.Организация = фин_ОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию(Пользователи.ТекущийПользователь(), "ОсновнаяОрганизация");
	КонецЕсли;
	Если Параметры.Свойство("ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента") Тогда 
		ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента = Параметры.ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента;
	Иначе 
		ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента = Ложь;
	КонецЕсли;	

	НадписьПериод 			= "Период";
	НадписьОтбор			= "Отбор";
	НадписьСписокПлатежей 	= "Список платежей";	
	
	ПоддержкаРаботыСоСтруктурнымиПодразделениями = фин_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьПризнакОтображенияСтруктурныхПодразделений();
		
	общ_РаботаСоСтруктурнымиПодразделениями.УстановитьВидимостьСтруктурногоПодразделения(Объект.Организация, Объект.СтруктурноеПодразделение, СтруктурноеПодразделениеОрганизация, ПоддержкаРаботыСоСтруктурнымиПодразделениями);
	общ_РаботаСоСтруктурнымиПодразделениями.УстановитьСвойстваЭлементаСтруктурноеПодразделениеОрганизация(Элементы.СтруктурноеПодразделениеОрганизация, Объект.СтруктурноеПодразделение, ПоддержкаРаботыСоСтруктурнымиПодразделениями);
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;	
	
	Если НЕ ЗначениеЗаполнено(Объект.СтруктурноеПодразделение) И Объект.ВключаяПодчиненные Тогда
		Объект.ВключаяПодчиненные = Ложь;
	КонецЕсли;
	Элементы.ВключаяПодчиненные.Видимость			= ЗначениеЗаполнено(Объект.СтруктурноеПодразделение);
	
	Если Объект.ВключаяПодчиненные Тогда
		Элементы.ДеревоЗаявокВидОплаты.Заголовок = "Вид оплаты/ Структурное подразделение/ Контрагент/ Договор/ Дата оплаты";
	Иначе
		Элементы.ДеревоЗаявокВидОплаты.Заголовок = "Вид оплаты/ Контрагент/ Договор/ Дата оплаты";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьНаСервере()

	РезультатЗаявок = дог_УправлениеДоговорами.СформироватьСписокПлатежей(Период.ДатаНачала,Период.ДатаОкончания,Объект.Организация,Объект.СтруктурноеПодразделение,Объект.ВключаяПодчиненные,Объект.Контрагент,Объект.Договор,ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,Истина,МинимальнаяДатаПлатежа);
	Дерево = РеквизитФормыВЗначение("ДеревоЗаявок");
	Дерево.Строки.Очистить();
	ВыборкаВидОплаты = РезультатЗаявок.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВидОплаты.Следующий() Цикл
		Строка = Дерево.Строки.Добавить();
		Строка.ВидОплатыОрг = ВыборкаВидОплаты.ВидОплаты;
		ВыборкаОрганизация = ВыборкаВидОплаты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОрганизация.Следующий() Цикл
			ВыборкаСП = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаСП.Следующий() Цикл
				Если Объект.ВключаяПодчиненные Тогда
					СтрокаСП = Строка.Строки.Добавить();
					СтрокаСП.ВидОплатыОрг = ВыборкаСП.СтруктурноеПодразделение;
					СтрокаДляДобавленияКонтрагента = СтрокаСП;
				Иначе
					СтрокаДляДобавленияКонтрагента = Строка;
				КонецЕсли;
		        ВыборкаКонтрагент = ВыборкаСП.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаКонтрагент.Следующий() Цикл
					СтрокаК = СтрокаДляДобавленияКонтрагента.Строки.Добавить();
					СтрокаК.ВидОплатыОрг = ВыборкаКонтрагент.Контрагент;
			        ВыборкаДоговор = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаДоговор.Следующий() Цикл
						СтрокаД = СтрокаК.Строки.Добавить();
						СтрокаД.ВидОплатыОрг = ВыборкаДоговор.Договор;
					    ВыборкаДатаОплаты = ВыборкаДоговор.Выбрать();
						Пока ВыборкаДатаОплаты.Следующий() Цикл
							СтрокаДО = СтрокаД.Строки.Добавить();
							СтрокаДО.ВидОплатыОрг = ВыборкаДатаОплаты.ДатаОплаты;
							СтрокаДО.Валюта = ВыборкаДатаОплаты.Валюта;
							СтрокаДО.Организация = ВыборкаДатаОплаты.Организация;
							СтрокаДО.СтруктурноеПодразделение = ВыборкаДатаОплаты.СтруктурноеПодразделение;
					        СтрокаДО.Сумма = ВыборкаДатаОплаты.Сумма;
							СтрокаДО.СуммаПени = ВыборкаДатаОплаты.СуммаПени;
							СтрокаДО.СуммаЗаявки = ВыборкаДатаОплаты.СуммаОстаточнойОплаты+СтрокаДО.СуммаПени;
							СтрокаДО.ЭтапОплаты = ВыборкаДатаОплаты.ЭтапОплаты;
							СтрокаДО.ДокументСобытия = ВыборкаДатаОплаты.ДокументСобытия;
							СтрокаДО.Сценарий = ВыборкаДатаОплаты.Сценарий;
							СтрокаДО.ВидОплатыПоДоговору = ВыборкаДатаОплаты.ВидОплатыПоДоговору;
							СтрокаДО.ВидОплаты = ВыборкаДатаОплаты.ВидОплаты;
							СтрокаДО.ФинансовыйПоказатель = ВыборкаДатаОплаты.ФинансовыйПоказатель;
							СтрокаДО.СчетКасса = ВыборкаДатаОплаты.СчетКасса;
							СтрокаДО.СтатьяДДС = ВыборкаДатаОплаты.СтатьяДДС;
							СтрокаДО.Подразделение = ВыборкаДатаОплаты.Подразделение;
							СтрокаДО.ВидОперацииЗаявки = ВыборкаДатаОплаты.ВидОперацииЗаявки;
						КонецЦикла;

					КонецЦикла;

				КонецЦикла;

			КонецЦикла;
			

		КонецЦикла;
		
	КонецЦикла;
		
	ЗначениеВРеквизитФормы(Дерево, "ДеревоЗаявок");
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево(ИмяДерева, СтрокиДерева)
	
	Для Каждого Строка Из  СтрокиДерева Цикл
    	Элементы[ИмяДерева].Развернуть(Строка.ПолучитьИдентификатор() ,Истина);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиВПодчиненных(Строки, Пометка)
	
	Для Каждого СтрокаПодчиненная Из Строки Цикл
		СтрокаПодчиненная.Применить = Пометка;
		УстановитьФлажкиВПодчиненных(СтрокаПодчиненная.ПолучитьЭлементы(),Пометка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаявкиСерв()
	
	Дерево = РеквизитФормыВЗначение("ДеревоЗаявок");
	ПолучитьСтрокиФормированияЗаявок(Дерево.Строки,МинимальнаяДатаПлатежа);
	ЗначениеВРеквизитФормы(Дерево,"ДеревоЗаявок");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьЗаявкиНаСервере(СтрокаДерева, ДатаПлатежа)
	
	Попытка
		Документ = Документы.ден_ПланируемоеПоступлениеДенежныхСредств.СоздатьДокумент();
		Документ.Дата = ТекущаяДата();
		
		Документ.Автор = ПараметрыСеанса.ТекущийПользователь;
		
		Документ.Ответственный = фин_ОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОсновнойОтветственный");
		Документ.Контрагент = СтрокаДерева.Контрагент;
		Документ.ДатаПоступления = ?(СтрокаДерева.ДатаОплаты<ДатаПлатежа,ДатаПлатежа,СтрокаДерева.ДатаОплаты);
		Документ.ВидОперации = СтрокаДерева.ВидОперацииЗаявки;
		Документ.ВключатьВПлатежныйКалендарь = Истина;
		Документ.Организация = СтрокаДерева.Организация;
		Документ.СтруктурноеПодразделение = СтрокаДерева.СтруктурноеПодразделение;
		Документ.ЦФО = СтрокаДерева.Подразделение;
		Документ.ФормаОплаты = СтрокаДерева.ВидОплаты;
	    Документ.ФинансовыйПоказатель = СтрокаДерева.ФинансовыйПоказатель;
		
		Если СтрокаДерева.ВидОплатыПоДоговору = Перечисления.дог_ВидыОплатыПоДоговору.ПоГрафику ИЛИ СтрокаДерева.ВидОплатыПоДоговору = Перечисления.дог_ВидыОплатыПоДоговору.ПоИндивидуальномуГрафику Тогда
			Документ.ЭтапОплаты = СтрокаДерева.ЭтапОплаты;
			Документ.ДокументСобытия = СтрокаДерева.ДокументСобытия;
		ИначеЕсли СтрокаДерева.ВидОплатыПоДоговору = Перечисления.дог_ВидыОплатыПоДоговору.Регулярная Тогда
			Документ.РасчетнаяДатаПрихода = СтрокаДерева.ДатаОплаты;
		КонецЕсли;
		
		Документ.БанковскийСчетКасса = СтрокаДерева.СчетКасса;
		Документ.ВалютаДокумента = Документ.БанковскийСчетКасса.ВалютаДенежныхСредств;
		СтруктураКурсаВалютаДокумента = фин_ОбщегоНазначенияСервер.ПолучитьКурсВалюты(Документ.ВалютаДокумента,СтрокаДерева.ДатаОплаты);
	    Документ.КурсДокумента        = СтруктураКурсаВалютаДокумента.Курс;
		Документ.КратностьДокумента   = СтруктураКурсаВалютаДокумента.Кратность;

		Документ.Состояние = Перечисления.СостоянияОбъектов.Подготовлен;
		СтруктураКурсаВалютаПлатежа = фин_ОбщегоНазначенияСервер.ПолучитьКурсВалюты(СтрокаДерева.Валюта,СтрокаДерева.ДатаОплаты);

		СтрокаТЧ = Документ.РасшифровкаПлатежа.Добавить();
		СтрокаТЧ.ДоговорКонтрагента = СтрокаДерева.Договор;
		СтрокаТЧ.СтатьяДвиженияДенежныхСредств = СтрокаДерева.СтатьяДДС;
		СтрокаТЧ.СуммаВзаиморасчетов = СтрокаДерева.Сумма;
		СтрокаТЧ.КратностьВзаиморасчетов = СтруктураКурсаВалютаПлатежа.Кратность;
		СтрокаТЧ.КурсВзаиморасчетов = СтруктураКурсаВалютаПлатежа.Курс;
		ВалютаВзаиморасчетов = СтрокаДерева.Валюта;
		
		Если ВалютаВзаиморасчетов=Документ.ВалютаДокумента Тогда
			СтрокаТЧ.СуммаПлатежа=СтрокаТЧ.СуммаВзаиморасчетов;
		
		ИначеЕсли (Документ.КурсДокумента <> 0) И (СтрокаТЧ.КратностьВзаиморасчетов <> 0) И (СтрокаТЧ.КурсВзаиморасчетов <> 0) Тогда
			СтрокаТЧ.СуммаПлатежа=фин_ОбщегоНазначенияКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрокаТЧ.СуммаВзаиморасчетов, ВалютаВзаиморасчетов,
			Документ.ВалютаДокумента,
			СтрокаТЧ.КурсВзаиморасчетов,Документ.КурсДокумента,
			СтрокаТЧ.КратностьВзаиморасчетов,Документ.КратностьДокумента);	
		Иначе
			СтрокаТЧ.СуммаПлатежа = 0;
		КонецЕсли;

		Документ.СуммаДокумента = СтрокаТЧ.СуммаПлатежа;
		Документ.Записать();
		Возврат Документ.Ссылка;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось сформировать заявку по договору """ + СтрокаДерева.Договор + """ на дату " + СтрокаДерева.ДатаОплаты + "
															| по причине: " + ОписаниеОшибки());

		Возврат Документы.ден_ПланируемоеПоступлениеДенежныхСредств.ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПолучитьСтрокиФормированияЗаявок(Строки,ДатаПлатежа)
	
	Для Каждого СтрокаПодчиненная Из Строки Цикл
		Если СтрокаПодчиненная.Применить 
			И СтрокаПодчиненная.СуммаЗаявки > 0 
			И НЕ ЗначениеЗаполнено(СтрокаПодчиненная.ППДС) Тогда
			
			СтруктураСтроки = Новый Структура("Контрагент,ДатаОплаты,Организация,СтруктурноеПодразделение,ВидОплаты,ФинансовыйПоказатель,Сценарий,Договор,СтатьяДДС,Сумма,СчетКасса,Валюта,Подразделение,ЭтапОплаты,ДокументСобытия, ВидОплатыПоДоговору, ВидОперацииЗаявки");
			ЗаполнитьЗначенияСвойств(СтруктураСтроки,СтрокаПодчиненная,"ФинансовыйПоказатель,Сценарий,СтатьяДДС,СчетКасса,Валюта,ВидОплаты,Подразделение,Организация,СтруктурноеПодразделение, ЭтапОплаты,ДокументСобытия, ВидОплатыПоДоговору, ВидОперацииЗаявки");
			СтруктураСтроки.ДатаОплаты = СтрокаПодчиненная.ВидОплатыОрг;
			СтруктураСтроки.Сумма = СтрокаПодчиненная.СуммаЗаявки;
			СтруктураСтроки.Договор = СтрокаПодчиненная.Родитель.ВидОплатыОрг;
			СтруктураСтроки.Контрагент = СтрокаПодчиненная.Родитель.Родитель.ВидОплатыОрг;
			СтрокаПодчиненная.ППДС = СформироватьЗаявкиНаСервере(СтруктураСтроки,ДатаПлатежа);
		КонецЕсли;
		
		ПолучитьСтрокиФормированияЗаявок(СтрокаПодчиненная.Строки,ДатаПлатежа);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыДерева(Строки, Массив, Параметр)

	Для Каждого СтрокаПодчиненная Из Строки Цикл
		Если ТипЗнч(СтрокаПодчиненная.ВидОплатыОрг) = Тип("Дата") Тогда
			Для Каждого ЭлМас Из Массив Цикл
			
				Если СтрокаПодчиненная.Применить Тогда
					СтрокаПодчиненная[Элмас] = Параметр[Элмас];	
				КонецЕсли;
					
			КонецЦикла;
		КонецЕсли;
		ЗаполнитьРеквизитыДерева(СтрокаПодчиненная.ПолучитьЭлементы(), Массив, Параметр);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПровестиНаСервере()
	
	Дерево = РеквизитФормыВЗначение("ДеревоЗаявок");
	ОбходДереваСПроведениемЗаявок(Дерево.Строки);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбходДереваСПроведениемЗаявок(Строки)
	
	Для Каждого СтрокаПодчиненная Из Строки Цикл
		Если СтрокаПодчиненная.Применить 
			И ЗначениеЗаполнено(СтрокаПодчиненная.ППДС) Тогда
			Попытка
				ДокументОбъект = СтрокаПодчиненная.ППДС.ПолучитьОбъект();
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Невозможно провести документ: " + СтрокаПодчиненная.ППДС + " " + ОписаниеОшибки());
			КонецПопытки;
			
		КонецЕсли;
		ОбходДереваСПроведениемЗаявок(СтрокаПодчиненная.Строки);
	КонецЦикла;
	
КонецПроцедуры
